# This file is generated by Anlogic Timing Wizard. 24 09 2019

#Derive PLL Clocks
derive_pll_clocks -gen_basic_clock
create_clock -name SYS_CLK -period 41.666 -waveform {0 20.833} [get_ports {SYS_CLK}]
create_clock -name PSRAM_CLK -period 10 -waveform {0 5} [get_ports {PSRAM_CLK}]
set_input_delay -clock PSRAM_CLK 7.5 -max [get_ports {PSRAM_SIO[0]}]
set_input_delay -clock PSRAM_CLK 2.5 -min [get_ports {PSRAM_SIO[0]}]
set_input_delay -clock PSRAM_CLK 7.5 -max [get_ports {PSRAM_SIO[1]}]
set_input_delay -clock PSRAM_CLK 2.5 -min [get_ports {PSRAM_SIO[1]}]
set_input_delay -clock PSRAM_CLK 7.5 -max [get_ports {PSRAM_SIO[2]}]
set_input_delay -clock PSRAM_CLK 2.5 -min [get_ports {PSRAM_SIO[2]}]
set_input_delay -clock PSRAM_CLK 7.5 -max [get_ports {PSRAM_SIO[3]}]
set_input_delay -clock PSRAM_CLK 2.5 -min [get_ports {PSRAM_SIO[3]}]
set_output_delay -clock PSRAM_CLK 4 -max [get_ports {PSRAM_CEn}]
set_output_delay -clock PSRAM_CLK -1.5 -min [get_ports {PSRAM_CEn}]
set_output_delay -clock PSRAM_CLK 4 -max [get_ports {PSRAM_SIO[0]}]
set_output_delay -clock PSRAM_CLK -1.5 -min [get_ports {PSRAM_SIO[0]}]
set_output_delay -clock PSRAM_CLK 4 -max [get_ports {PSRAM_SIO[1]}]
set_output_delay -clock PSRAM_CLK -1.5 -min [get_ports {PSRAM_SIO[1]}]
set_output_delay -clock PSRAM_CLK 4 -max [get_ports {PSRAM_SIO[2]}]
set_output_delay -clock PSRAM_CLK -1.5 -min [get_ports {PSRAM_SIO[2]}]
set_output_delay -clock PSRAM_CLK 4 -max [get_ports {PSRAM_SIO[3]}]
set_output_delay -clock PSRAM_CLK -1.5 -min [get_ports {PSRAM_SIO[3]}]


