create_clock -name SYS_CLK -period 100 -waveform {0 50} [get_ports {SYS_CLK}]
create_clock -name PSRAM_CLK -period 10 -waveform {0 5} [get_ports {PSRAM_CLK}]
set_input_delay -clock PSRAM_CLK 7.5 -max -add_delay [get_ports {PSRAM_SIO[0]}]
set_input_delay -clock PSRAM_CLK 2.5 -min -add_delay [get_ports {PSRAM_SIO[0]}]
set_input_delay -clock PSRAM_CLK 7.5 -max -add_delay [get_ports {PSRAM_SIO[1]}]
set_input_delay -clock PSRAM_CLK 2.5 -min -add_delay [get_ports {PSRAM_SIO[1]}]
set_input_delay -clock PSRAM_CLK 7.5 -max -add_delay [get_ports {PSRAM_SIO[2]}]
set_input_delay -clock PSRAM_CLK 2.5 -min -add_delay [get_ports {PSRAM_SIO[2]}]
set_input_delay -clock PSRAM_CLK 7.5 -max -add_delay [get_ports {PSRAM_SIO[3]}]
set_input_delay -clock PSRAM_CLK 2.5 -min -add_delay [get_ports {PSRAM_SIO[3]}]
set_output_delay -clock PSRAM_CLK 4 -max -add_delay [get_ports {PSRAM_CEn}]
set_output_delay -clock PSRAM_CLK -1.5 -min -add_delay [get_ports {PSRAM_CEn}]
set_output_delay -clock PSRAM_CLK 4 -max -add_delay [get_ports {PSRAM_SIO[0]}]
set_output_delay -clock PSRAM_CLK -1.5 -min -add_delay [get_ports {PSRAM_SIO[0]}]
set_output_delay -clock PSRAM_CLK 4 -max -add_delay [get_ports {PSRAM_SIO[1]}]
set_output_delay -clock PSRAM_CLK -1.5 -min -add_delay [get_ports {PSRAM_SIO[1]}]
set_output_delay -clock PSRAM_CLK 4 -max -add_delay [get_ports {PSRAM_SIO[2]}]
set_output_delay -clock PSRAM_CLK -1.5 -min -add_delay [get_ports {PSRAM_SIO[2]}]
set_output_delay -clock PSRAM_CLK 4 -max -add_delay [get_ports {PSRAM_SIO[3]}]
set_output_delay -clock PSRAM_CLK -1.5 -min -add_delay [get_ports {PSRAM_SIO[3]}]
